pwbf/RX64M_ETHERNET/r_t4_http_server_rx/src/r_http_server.c
/*******************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only
* intended for use with Renesas products. No other uses are authorized. This
* software is owned by Renesas Electronics Corporation and is protected under
* all applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT
* LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE
* AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED.
* TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS
* ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE
* FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR
* ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE
* BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software
* and to discontinue the availability of this software. By using this software,
* you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2011-2013 Renesas Electronics Corporation. All rights reserved.
*******************************************************************************/
/*******************************************************************************
* File Name    : r_http_server.c
* Version      : 1.01
* Device(s)    :
* Tool-Chain   :
* OS           : none
* H/W Platform :
* Description  : HTTP server code.
******************************************************************************/
/******************************************************************************
* History : DD.MM.YYYY Version Description
*         : 01.04.2011 1.00    First Release
*         : 16.04.2013 1.01    Changed sys_time to none static variable.
******************************************************************************/

/******************************************************************************
Includes <System Includes> , "Project Includes"
******************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>
#include "r_t4_itcpip.h"
#include "r_t4_file_driver_rx_if.h"
#include "r_http_server_config.h"
#include "r_t4_http_server_rx_if.h"

/******************************************************************************
Macro definitions
******************************************************************************/
#define CONST const

#define RESTYPE_NON     0x00
#define RESTYPE_CGI     0x01
#define RESTYPE_FILE    0x02
#define RESTYPE_INDEXES 0x03
#define HTTP_SRV

#define HTTPD_CLOSED                0
#define HTTPD_ACCEPT                1
#define HTTPD_WAIT_REQUEST          2
#define HTTPD_CGI_PENDING           3
#define HTTPD_CGI_GEN_RESPONSE      4
#define HTTPD_SEND_RESPONSE_HEADER  5
#define HTTPD_SEND_RESPONSE_BODY    6
#define HTTPD_CLOSING               7

#define METHOD_GET     1
#define METHOD_HEAD    2
#define METHOD_ERR     -1

#define HTTP_ERROR_CODE_404 404
#define HTTP_ERROR_CODE_500 500
#define HTTP_ERROR_CODE_501 501

#define SNAME_LEN 12
#define SNAME_LIMIT_LEN 10

/******************************************************************************
Typedef definitions
******************************************************************************/
typedef struct http_cep_
{
    uint8_t status;
    uint8_t current_cgi_func_index;
    uint8_t hdr_buff[HDR_BUF_SIZE];
    uint8_t body_buff[BODY_BUF_SIZE];
    uint8_t rcv_buff[RCV_BUF_SIZE];
    int32_t remain_data;
    int32_t now_data;
    int32_t total_rcv_len;
    int32_t fileid;
    T_IPV4EP dstaddr;
    HTTPD_RESOURCE_INFO res_info;
    FILE_LIST file_list[HTTP_MAX_FILE_LIST];
    DATE_INFO current_file_date_info;
} HTTP_CEP;

/******************************************************************************
Private global variables and functions
******************************************************************************/
static ER httpd_rcv_request(ID cepid, uint8_t *buf, int16_t buf_len, HTTPD_RESOURCE_INFO *res_info, ER rcv_dat_size);
static ER httpd_parse_request(ID cepid, uint8_t *buf, HTTPD_RESOURCE_INFO *res_info);
static ER httpd_parse_request_not_found(ID cepid);
static ER httpd_parse_request_internal_server_error(ID cepid);
static ER httpd_parse_request_not_implemented(ID cepid);
static ER httpd_gen_response_cgi(ID cepid, ER ercd);

static ER gen_response_header(ID cepid, uint8_t *uri, uint8_t *buf, uint32_t content_length);
static ER gen_response_error_header(uint8_t *buf, int32_t error_code);
static ER gen_response_indexes(ID cepid, uint8_t *dir_name);
static ER gen_response_cgi(ID cepid, uint8_t *buf);

static ER set_http_resource(ID cepid, uint32_t hdr_size, uint8_t *hdr_buff, uint32_t body_size, uint8_t *body_buff);
static ER set_lastmodified_date(ID cepid, uint8_t *buf, DATE_INFO *date_info);
static ER set_content_type(int16_t extension_no, uint8_t *buf);
static ER set_content_length(uint32_t content_size, uint8_t *buf);
static ER set_allow(uint8_t *buf);

static ER get_extension_no(uint8_t *buf);
static ER align_file_name_space(const uint8_t *src, uint8_t *dst, uint8_t **space);
static ER extension_check(uint8_t *buf);
static ER method_check(uint8_t *buf);
static ER strcat_with_check_len(uint8_t *src, uint8_t *concat, int32_t size);
static ER is_request_cgi(uint8_t *buf);

static uint8_t *get_time(void);
static uint8_t *conv_month_for_systime(int32_t file_month);
static uint8_t *conv_day_for_systime(int32_t tmp_year, int32_t tmp_month, int32_t tmp_day);

static const uint8_t day_data[7][4] = {{"Sun"}, {"Mon"}, {"Tue"}, {"Wed"}, {"Thu"}, {"Fri"}, {"Sat"}};
static const uint8_t month_data[12][4] = {{"Jan"}, {"Feb"}, {"Mar"}, {"Apr"}, {"May"}, {"Jun"}, {"Jul"}, {"Aug"}, {"Sep"}, {"Oct"}, {"Nov"}, {"Dec"}};

