pwbf/RX64M_ETHERNET/r_t4_http_server_rx/src/r_http_server.c
/******************************************************************************
Exported global variables and functions (to be accessed by other files)
******************************************************************************/
HTTP_CEP http_cep[HTTP_TCP_CEP_NUM];
uint8_t lf_code[] = LF_CODE;
ER http_callback(ID cepid, FN fncd , VP p_parblk);

/******************************************************************************
Imported global variables and functions (from other files)
******************************************************************************/
extern char _T4_Version[];
extern SYS_TIME *get_sys_time(void);

/*------------ PROCESS -----------*/

/******************************************************************************
* Function Name : R_httpd
* Description   : Watch the HTTP server status.
* Argument      : none
* Return Value  : none
******************************************************************************/
void R_httpd(void)
{
    ER   ercd;
    uint32_t  i;
    static int32_t init_flag = 0;

    /* Initialize process */
    if (init_flag == 0)
    {
        memset(http_cep, 0, sizeof(http_cep));
        init_flag = 1;
        for (i = 0; i < HTTP_TCP_CEP_NUM; i++)
        {
            http_cep[i].fileid = -1;
        }
    }

    /* This function checks all communication endpoint */
    for (i = 0; i < HTTP_TCP_CEP_NUM; i++)
    {
        switch (http_cep[i].status)
        {
            case HTTPD_CLOSED:
                /* accept */
                ercd = tcp_acp_cep(i + HTTP_START_TCP_CEP + 1, i + HTTP_START_TCP_CEP + 1, &http_cep[i].dstaddr, TMO_NBLK);
                if (ercd != E_WBLK)
                {
                    while (1);
                }
                http_cep[i].status = HTTPD_ACCEPT;
                break;
            case HTTPD_CGI_GEN_RESPONSE:
                if (cgi_file_name_table[http_cep[i].current_cgi_func_index].cgi_cb_func != NULL)
                {
                    ercd = cgi_file_name_table[ http_cep[i].current_cgi_func_index].cgi_cb_func(i + 1, &http_cep[i].res_info.res);

                    ercd = httpd_gen_response_cgi(i + 1, ercd);
                    if (ercd == 0)
                    {
                        /* start transmitting response header */
                        tcp_snd_dat(i + HTTP_START_TCP_CEP + 1, (VP)http_cep[i].res_info.res.hdr, http_cep[i].res_info.res.hdr_size, TMO_NBLK);
                        http_cep[i].status = HTTPD_SEND_RESPONSE_HEADER;
                        http_cep[i].now_data = 0;
                        http_cep[i].remain_data = http_cep[i].res_info.res.hdr_size;
                    }
                    else
                    {
                        /* no transmit when there is no body data */
                        http_cep[i].now_data = 0;
                        http_cep[i].remain_data = 0;
                        http_cep[i].status = HTTPD_CLOSING;
                        tcp_cls_cep(i + HTTP_START_TCP_CEP + 1, TMO_NBLK);
                    }
                }
                else
                {
                    while (1);
                }
            default:
                break;
        }
    }
}

void R_httpd_pending_release_request(ID cepid)
{
    if (cepid <= 0)
    {
        while (1);  /* System error !! */
    }

    http_cep[cepid-1].status = HTTPD_CGI_GEN_RESPONSE;
}

static ER httpd_gen_response_cgi(ID cepid, ER ercd)
{
    if (ercd < 0 || http_cep[cepid-1].res_info.res.body == 0 || http_cep[cepid-1].res_info.res.body_size == 0)
    {
        return httpd_parse_request_internal_server_error(cepid);
    }

    /* generate response header */
    if (gen_response_cgi(cepid, http_cep[cepid-1].hdr_buff) < 0)
    {
        return httpd_parse_request_internal_server_error(cepid);
    }
    /* set response information */
    set_http_resource(cepid, strlen((char*)http_cep[cepid-1].hdr_buff), http_cep[cepid-1].hdr_buff, strlen((char*)http_cep[cepid-1].body_buff), http_cep[cepid-1].body_buff);

    return 0;
}


static ER httpd_rcv_request(ID cepid, uint8_t *buf, int16_t buf_len, HTTPD_RESOURCE_INFO *res_info, ER rcv_dat_size)
{
    uint8_t *ptr;
    ER ercd;

    if (rcv_dat_size <= 0)
    {
        http_cep[cepid-1].total_rcv_len = 0;
        return -1;
    }

    http_cep[cepid-1].total_rcv_len += rcv_dat_size;

    if (http_cep[cepid-1].total_rcv_len > (buf_len - 1))
    {
        /* If buffer is full,do not receive. */
        http_cep[cepid-1].total_rcv_len = 0;
        return -1;
    }
    buf[http_cep[cepid-1].total_rcv_len] = '\0';

    ptr = (uint8_t *)strstr((char*)buf, "\r\n\r\n");
    if (ptr != 0)
    {
        *(ptr + 4) = '\0';
        http_cep[cepid-1].total_rcv_len = 0;
//  if (httpd_parse_request(cepid, buf, res_info) < 0)

        ercd = httpd_parse_request(cepid, buf, res_info);

        /* pend sending */
        if (ercd == -2)
        {
            return -2;
        }
        else if (ercd < 0)
        {
            return -1;
        }
        return 0;
    }

    /* continue receiving */
    return -3;
}


static ER httpd_parse_request(ID cepid, uint8_t *buf, HTTPD_RESOURCE_INFO *res_info)
{
    uint8_t  *p, *q;
    uint8_t  ch = 0;

    int8_t method_no = 0;
    uint8_t tmp_path[256];

    uint32_t i;
    ER ercd;

    memset(&res_info->res, 0, sizeof(HTTPD_RESOURCE));

    /* check method */
    method_no = method_check(buf);
    if (method_no == METHOD_ERR)
    {
        return httpd_parse_request_not_implemented(cepid);
    }
    if (method_no == METHOD_GET)
    {
        buf += (sizeof("GET ") - 1);
    }
    else
    {
        buf += (sizeof("HEAD ") - 1);
    }

    p = buf;
    q = NULL;
    while (1)
    {
        ch = *p++;
        if (ch == ' ' || ch == '&')    /* first argument is only available */
        {
            *(p - 1) = '\0';
            break;
        }
        else if (ch == '?')
        {
            q = p;
        }
        else if (ch == '\0')
        {
            return httpd_parse_request_internal_server_error(cepid);
        }
    }
    if (q != NULL)
    {
        strncpy((char*)res_info->param, (const char*)q, QUERY_PARAM_SIZE - 1);
        res_info->param[QUERY_PARAM_SIZE-1] = '\0';
    }

    /* generate file path */
    tmp_path[0] = 0;
    strcat_with_check_len(tmp_path, (uint8_t*)httpd_root_directry, sizeof(tmp_path));
    strcat_with_check_len(tmp_path, (uint8_t*)buf, sizeof(tmp_path));

    /* case : specified directory */
    if ((uint8_t)(tmp_path[strlen((char*)tmp_path)-1]) == '/')
    {
        if (indexes == 0)
        {
            strcpy((char*)tmp_path, (const char *)httpd_root_directry);
            strcat((char*)tmp_path, (const char *)default_file_name);
        }
        else
        {
            /* generate indexes page */
            if (gen_response_indexes(cepid, (uint8_t*)tmp_path) == 0)
            {
                /* set response information */
                set_http_resource(cepid, strlen((char*)http_cep[cepid-1].hdr_buff), http_cep[cepid-1].hdr_buff, strlen((char*)http_cep[cepid-1].body_buff), http_cep[cepid-1].body_buff);
                http_cep[cepid-1].res_info.res.type = RESTYPE_INDEXES;
                return 0;
            }
            else
            {
                return httpd_parse_request_internal_server_error(cepid);
            }
        }
    }
    if (is_request_cgi(tmp_path) != 0)
    {
        /* search resources */
        http_cep[cepid-1].fileid = file_open((uint8_t *)tmp_path, FILE_READ);
        if (http_cep[cepid-1].fileid < 0)
        {
            return httpd_parse_request_not_found(cepid);
        }
        get_file_info(http_cep[cepid-1].fileid, &http_cep[cepid-1].current_file_date_info);
        http_cep[cepid-1].res_info.res.type = RESTYPE_FILE;

        /* generate response header */
        if (gen_response_header(cepid, buf, http_cep[cepid-1].hdr_buff, get_file_size(http_cep[cepid-1].fileid)) < 0)
        {
            return httpd_parse_request_internal_server_error(cepid);
        }
        /* set response information */
        set_http_resource(cepid, strlen((char*)http_cep[cepid-1].hdr_buff), http_cep[cepid-1].hdr_buff, get_file_size(http_cep[cepid-1].fileid), http_cep[cepid-1].body_buff);
        return 0;
    }

    else
    {
        /* serch resources for CGI */
        for (i = 0; i < MAX_CGI_FILE; i++)
        {
            if (strstr((const char*)tmp_path, (const char*)cgi_file_name_table[i].file_name))
            {
                break; // exist cgi file
            }
        }
        if (i == MAX_CGI_FILE)
        {
            return httpd_parse_request_not_found(cepid);
        }

        /* CGI fuction pointer null check */
        if (NULL == cgi_file_name_table[i].cgi_func)
        {
            return httpd_parse_request_not_found(cepid);
        }

        /* Regist CGI function */
        http_cep[cepid-1].res_info.res.type = RESTYPE_CGI;
        http_cep[cepid-1].res_info.res.cgi_func = cgi_file_name_table[i].cgi_func;
        http_cep[cepid-1].res_info.res.body = http_cep[cepid-1].body_buff;

        /* execute cgi function */
        ercd = (*http_cep[cepid-1].res_info.res.cgi_func)(cepid, &http_cep[cepid-1].res_info.res);

