pwbf/RX64M_ETHERNET/r_t4_http_server_rx/src/r_http_server.c
        /* -2: CGI pending */
        if (ercd == -2)
        {
            http_cep[cepid-1].current_cgi_func_index = i;
            return -2;
        }
        /* 0: Normal termination, -1: Internal error */
        else
        {
            ercd = httpd_gen_response_cgi(cepid, ercd);
        }

        return ercd;
    }

    /* erro path */
    return -1;
}

static ER httpd_parse_request_not_found(ID cepid)
{
    /* generate 404 Not Found response header */
    if (gen_response_error_header(http_cep[cepid-1].hdr_buff, HTTP_ERROR_CODE_404) < 0)
    {
        return httpd_parse_request_internal_server_error(cepid);
    }

    /* set response information */
    set_http_resource(cepid, strlen((char*)http_cep[cepid-1].hdr_buff), http_cep[cepid-1].hdr_buff, 0, http_cep[cepid-1].body_buff);

    return 0;
}

/* default error */
static ER httpd_parse_request_internal_server_error(ID cepid)
{

    /* generate 500 Internal Server Error response header */
    if (gen_response_error_header(http_cep[cepid-1].hdr_buff, HTTP_ERROR_CODE_500) < 0)
    {
        return -1;
    }

    /* set response information */
    set_http_resource(cepid, strlen((char*)http_cep[cepid-1].hdr_buff), http_cep[cepid-1].hdr_buff, 0, http_cep[cepid-1].body_buff);

    return 0;
}

static ER httpd_parse_request_not_implemented(ID cepid)
{
    /* generate 501 Not Implemented response header */
    if (gen_response_error_header(http_cep[cepid-1].hdr_buff, HTTP_ERROR_CODE_501) < 0)
    {
        return httpd_parse_request_internal_server_error(cepid);
    }

    /* set response information */
    set_http_resource(cepid, strlen((char*)http_cep[cepid-1].hdr_buff), http_cep[cepid-1].hdr_buff, 0, http_cep[cepid-1].body_buff);

    return 0;

}

static ER method_check(uint8_t *buf)
{

    int8_t ret = METHOD_ERR;

    if (strncmp((char*)buf, "GET ", 4) == 0)
    {
        ret = METHOD_GET;
    }
    if (strncmp((char*)buf, "HEAD ", 5) == 0)
    {
        ret = METHOD_HEAD;
    }
    return ret;
}


static ER extension_check(uint8_t *buf)
{

    int16_t loop;
    int32_t ret;
    uint8_t tmp_extension[4];

    tmp_extension[0] = (uint8_t)tolower((int32_t) * buf);
    tmp_extension[1] = (uint8_t)tolower((int32_t) * (buf + 1));
    tmp_extension[2] = (uint8_t)tolower((int32_t) * (buf + 2));
    tmp_extension[3] = 0;

    for (loop = 0; loop < MAX_EXTENSION; loop++)
    {
        if (strcmp((const char*)tmp_extension, (const char *)extension_data[loop].extension_type) == 0)
        {
            ret = loop;
            break;
        }
    }
    if (loop == MAX_EXTENSION)
    {
        ret = 0;
    }
    return ret;
}


static ER set_allow(uint8_t *buf)
{
    sprintf((char *)buf, "Allow: GET, HEAD\r\n");
    return(12);
}

static ER set_content_length(uint32_t content_size, uint8_t *buf)
{
    sprintf((char *)buf, "Content-Length: %d\r\n", content_size);

    return strlen((const char *)buf);

}

static ER set_content_type(int16_t extension_no, uint8_t *buf)
{
    if (extension_no < 0)
    {
        return -1;
    }

    sprintf((char *)buf, "Content-Type: %s\r\n", &extension_data[extension_no].content_type_buf[0]);

    return strlen((const char *)buf);

}

static ER set_lastmodified_date(ID cepid, uint8_t *buf, DATE_INFO *date_info)
{
    sprintf((char *)buf, "Last-Modified: %s, %d %s %02d %02d:%02d:%02d GMT\r\n",
            date_info->day_of_the_week,
            date_info->day,
            date_info->month,
            date_info->year,
            date_info->hour,
            date_info->min,
            date_info->sec
           );
    return 0;
}

static ER set_http_resource(ID cepid, uint32_t hdr_size, uint8_t *hdr_buff, uint32_t body_size, uint8_t *body_buff)
{
    http_cep[cepid-1].res_info.res.hdr_size = hdr_size;
    http_cep[cepid-1].res_info.res.hdr = hdr_buff;
    http_cep[cepid-1].res_info.res.body_size = body_size;
    http_cep[cepid-1].res_info.res.body = body_buff;
    return 0;
}

static ER get_extension_no(uint8_t *buf)
{
    ER extension_no;
    uint8_t *ptr;

    ptr = (uint8_t *)strchr((char*)buf, '.');
    extension_no = extension_check(ptr + 1);
    return extension_no;

}

static ER gen_response_header(ID cepid, uint8_t *uri, uint8_t *buf, uint32_t content_length)
{
    uint8_t tmp_buf[128];
    uint8_t crlf[] = "\r\n";
    ER ercd = 0;

    buf[0] = 0;

    sprintf((char *)tmp_buf, "HTTP/1.0 200 OK\r\n");
    ercd += strcat_with_check_len((uint8_t*)buf, tmp_buf, HDR_BUF_SIZE);

    sprintf((char *)tmp_buf, "Date: %s\r\n", get_time());
    ercd += strcat_with_check_len((uint8_t*)buf, tmp_buf, HDR_BUF_SIZE);

    // Server:
    sprintf((char *)tmp_buf, "Server: %s\r\n", HTTPD_VERSION_CODE);
    ercd += strcat_with_check_len((uint8_t*)buf, tmp_buf, HDR_BUF_SIZE);

    // Allow:
    set_allow(tmp_buf);
    ercd += strcat_with_check_len((uint8_t*)buf, tmp_buf, HDR_BUF_SIZE);

    // Last-Modified:
    set_lastmodified_date(cepid, tmp_buf, &http_cep[cepid-1].current_file_date_info);
    ercd += strcat_with_check_len((uint8_t*)buf, tmp_buf, HDR_BUF_SIZE);

    // Content-Type:
    set_content_type(get_extension_no((uint8_t *)uri), tmp_buf);
    ercd += strcat_with_check_len((uint8_t*)buf, tmp_buf, HDR_BUF_SIZE);

    // Content-Length:
    set_content_length(content_length, tmp_buf);
    ercd += strcat_with_check_len((uint8_t*)buf, tmp_buf, HDR_BUF_SIZE);

    // Connection:
    sprintf((char *)tmp_buf, "Connection: Close\r\n");
    ercd += strcat_with_check_len((uint8_t*)buf, tmp_buf, HDR_BUF_SIZE);

    // End of header
    ercd += strcat_with_check_len((uint8_t*)buf, crlf, HDR_BUF_SIZE);

    return 0;
}

static ER gen_response_error_header(uint8_t *buf, int32_t error_code)
{
    uint8_t tmp_buf[128];
    uint8_t crlf[] = "\r\n";
    ER ercd = 0;

    buf[0] = 0;

    switch (error_code)
    {
        case HTTP_ERROR_CODE_404:
            sprintf((char *)tmp_buf, "HTTP/1.0 404 Not Found\r\n");
            ercd += strcat_with_check_len((uint8_t*)buf, tmp_buf, HDR_BUF_SIZE);
            break;

        case HTTP_ERROR_CODE_500:
            sprintf((char *)tmp_buf, "HTTP/1.0 500 Internal Server Error\r\n");
            ercd += strcat_with_check_len((uint8_t*)buf, tmp_buf, HDR_BUF_SIZE);
            break;

        case HTTP_ERROR_CODE_501:
            sprintf((char *)tmp_buf, "HTTP/1.0 501 Not Implemented \r\n");
            ercd += strcat_with_check_len((uint8_t*)buf, tmp_buf, HDR_BUF_SIZE);
            break;
    }

    sprintf((char *)tmp_buf, "Date: %s\r\n", get_time());
    ercd += strcat_with_check_len((uint8_t*)buf, tmp_buf, HDR_BUF_SIZE);

    // Server:
    sprintf((char *)tmp_buf, "Server: %s\r\n", HTTPD_VERSION_CODE);
    ercd += strcat_with_check_len((uint8_t*)buf, tmp_buf, HDR_BUF_SIZE);

    // Connection:
    sprintf((char *)tmp_buf, "Connection: Close\r\n");
    ercd += strcat_with_check_len((uint8_t*)buf, tmp_buf, HDR_BUF_SIZE);

    // End of header
    ercd += strcat_with_check_len((uint8_t*)buf, crlf, HDR_BUF_SIZE);

    return ercd;
}


