pwbf/RX64M_ETHERNET/r_t4_http_server_rx/src/r_http_server.c
static ER align_file_name_space(const uint8_t *src, uint8_t *dst, uint8_t **space)
{
    static const uint8_t c_space[SNAME_LEN+1] = "            ";
    int32_t src_len;

    src_len = strlen((const char *)src);
    if (src_len > SNAME_LEN)
    {
        strncpy((char *)dst, (const char *)src, SNAME_LIMIT_LEN);
        dst[SNAME_LIMIT_LEN+1] = '~';
        dst[SNAME_LIMIT_LEN+1] = src[src_len-1];
        *space = (uint8_t *) & c_space[SNAME_LEN-1];
    }
    else
    {
        strcpy((char *)dst, (const char *)src);
        *space = (uint8_t *) & c_space[src_len];
    }

    return 0;
}

static ER gen_response_indexes(ID cepid, uint8_t *dir_name)
{
    uint8_t tmp_buf[512];
    uint8_t parent_dir_name[256];
    uint8_t crlf[] = "\r\n";
    int32_t i = 0;
    uint8_t shortname[13];
    uint8_t *p_space;
    ER ercd = 0;
    uint8_t *user_path;
    int32_t filenum;

    http_cep[cepid-1].hdr_buff[0] = 0;
    http_cep[cepid-1].body_buff[0] = 0;

    // generate body
    filenum = get_file_list_info((uint8_t *)dir_name, http_cep[cepid-1].file_list, HTTP_MAX_FILE_LIST, 0);
    if (filenum < 0)
    {
        return -1;
    }

    sprintf((char *)tmp_buf, "<html>%s<body>%s<pre>%s", lf_code, lf_code, lf_code);
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].body_buff, tmp_buf, sizeof(http_cep[cepid-1].body_buff));

    user_path = (uint8_t *)strstr((const char *)dir_name, (const char *)httpd_root_directry);
    user_path += strlen((const char *)httpd_root_directry);
    sprintf((char *)tmp_buf, "Index of %s %s%s", user_path, lf_code, lf_code, lf_code);
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].body_buff, tmp_buf, sizeof(http_cep[cepid-1].body_buff));

    sprintf((char *)tmp_buf, "        Name            Last modified       Size%s", lf_code);
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].body_buff, tmp_buf, sizeof(http_cep[cepid-1].body_buff));

    sprintf((char *)tmp_buf, "<hr>%s", lf_code);
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].body_buff, tmp_buf, sizeof(http_cep[cepid-1].body_buff));

    /* display parent directory */
    if (strlen((const char *)user_path) != 1)
    {
        strcpy((char *)parent_dir_name, (const char *)user_path);
        parent_dir_name[strlen((const char *)parent_dir_name)-1] = 0;
        *(strrchr((const char *)parent_dir_name, '/')) = 0;
        sprintf((char *)tmp_buf, "<a href=%s/>Parent Directory</a> ", parent_dir_name);
        ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].body_buff, tmp_buf, sizeof(http_cep[cepid-1].body_buff));
        /* line feed code */
        sprintf((char *)tmp_buf, "%s", lf_code);
        ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].body_buff, tmp_buf, sizeof(http_cep[cepid-1].body_buff));
    }

    while (i < HTTP_MAX_FILE_LIST)
    {
        if (http_cep[cepid-1].file_list[i].file_name[0] == 0)
        {
            break;
        }
        else
        {
            /* directory name */
            if ((http_cep[cepid-1].file_list[i].file_attr & FILE_ATTR_DIR) == FILE_ATTR_DIR)
            {
                align_file_name_space((const uint8_t *)http_cep[cepid-1].file_list[i].file_name, shortname, &p_space);
                sprintf((char *)tmp_buf, "<a href=%s%s/>%s</a>%s     ", user_path, http_cep[cepid-1].file_list[i].file_name, shortname, p_space);
            }
            /* file name */
            else
            {
                align_file_name_space((const uint8_t *)http_cep[cepid-1].file_list[i].file_name, shortname, &p_space);
                sprintf((char *)tmp_buf, "<a href=%s%s>%s</a>%s     ", user_path, http_cep[cepid-1].file_list[i].file_name, shortname, p_space);

            }
            ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].body_buff, tmp_buf, sizeof(http_cep[cepid-1].body_buff));

            /* Last modified */
            sprintf((char *)tmp_buf, "%2d-%s-%02d %02d:%02d:%02d ",
                    http_cep[cepid-1].file_list[i].date_info.day,
                    http_cep[cepid-1].file_list[i].date_info.month,
                    http_cep[cepid-1].file_list[i].date_info.year,
                    http_cep[cepid-1].file_list[i].date_info.hour,
                    http_cep[cepid-1].file_list[i].date_info.min,
                    http_cep[cepid-1].file_list[i].date_info.sec
                   );
            ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].body_buff, tmp_buf, sizeof(http_cep[cepid-1].body_buff));

            /* directory disp */
            if ((http_cep[cepid-1].file_list[i].file_attr & FILE_ATTR_DIR) == FILE_ATTR_DIR)
            {
                sprintf((char *)tmp_buf, "     (dir)");
            }
            /* file size disp*/
            else
            {
                sprintf((char *)tmp_buf, "%10ld", http_cep[cepid-1].file_list[i].file_size);
            }
            ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].body_buff, tmp_buf, sizeof(http_cep[cepid-1].body_buff));

            /* line feed code */
            sprintf((char *)tmp_buf, "%s", lf_code);
            ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].body_buff, tmp_buf, sizeof(http_cep[cepid-1].body_buff));
        }
        i++;
    }

    sprintf((char *)tmp_buf, "<hr>%s", lf_code);
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].body_buff, tmp_buf, sizeof(http_cep[cepid-1].body_buff));

    sprintf((char *)tmp_buf, "%s", HTTPD_VERSION_CODE);
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].body_buff, tmp_buf, sizeof(http_cep[cepid-1].body_buff));

    sprintf((char *)tmp_buf, "</pre>%s</body>%s</html>", lf_code, lf_code, lf_code);
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].body_buff, tmp_buf, sizeof(http_cep[cepid-1].body_buff));

    // generate header
    sprintf((char *)tmp_buf, "HTTP/1.0 200 OK\r\n");
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].hdr_buff, tmp_buf, sizeof(http_cep[cepid-1].hdr_buff));

    sprintf((char *)tmp_buf, "Date: %s\r\n", get_time());
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].hdr_buff, tmp_buf, sizeof(http_cep[cepid-1].hdr_buff));

    // Server:
    sprintf((char *)tmp_buf, "Server: %s\r\n", HTTPD_VERSION_CODE);
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].hdr_buff, tmp_buf, sizeof(http_cep[cepid-1].hdr_buff));

    // Content-Length:
    set_content_length(strlen((char*)http_cep[cepid-1].body_buff), tmp_buf);
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].hdr_buff, tmp_buf, sizeof(http_cep[cepid-1].hdr_buff));

    // Connection:
    sprintf((char *)tmp_buf, "Connection: Close\r\n");
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].hdr_buff, tmp_buf, sizeof(http_cep[cepid-1].hdr_buff));

    // End of header
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].hdr_buff, crlf, sizeof(http_cep[cepid-1].hdr_buff));

    return ercd;
}

static ER gen_response_cgi(ID cepid, uint8_t *buf)
{
    ER ercd = 0;
    uint8_t tmp_buf[256];
    uint8_t crlf[] = "\r\n";

    buf[0] = 0;

