pwbf/RX64M_ETHERNET/r_t4_http_server_rx/src/r_http_server.c
    // generate header
    sprintf((char *)tmp_buf, "HTTP/1.0 200 OK\r\n");
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].hdr_buff, tmp_buf, sizeof(http_cep[cepid-1].hdr_buff));

    sprintf((char *)tmp_buf, "Date: %s\r\n", get_time());
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].hdr_buff, tmp_buf, sizeof(http_cep[cepid-1].hdr_buff));

    // Server:
    sprintf((char *)tmp_buf, "Server: %s\r\n", HTTPD_VERSION_CODE);
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].hdr_buff, tmp_buf, sizeof(http_cep[cepid-1].hdr_buff));

    // Content-Length:
    set_content_length(strlen((char*)http_cep[cepid-1].body_buff), tmp_buf);
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].hdr_buff, tmp_buf, sizeof(http_cep[cepid-1].hdr_buff));

    // Connection:
    sprintf((char *)tmp_buf, "Connection: Close\r\n");
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].hdr_buff, tmp_buf, sizeof(http_cep[cepid-1].hdr_buff));

    // End of header
    ercd += strcat_with_check_len((uint8_t*)http_cep[cepid-1].hdr_buff, crlf, sizeof(http_cep[cepid-1].hdr_buff));

    return ercd;
}

static ER strcat_with_check_len(uint8_t *src, uint8_t *concat, int32_t size)
{
    if (strlen((const char *)src) + strlen((const char *)concat) >= size)
    {
        return -1;
    }
    strcat((char *)src, (const char *)concat);
    return 0;
}

static ER is_request_cgi(uint8_t *buf)
{
    char *strstr_return;
    ER return_value;

    strstr_return = strstr((const char*)buf, (const char *)".cgi");

    if (strstr_return == 0)
    {
        return_value = -1;
    }
    else
    {
        return_value = 0;
    }
    return return_value;
}

static uint8_t *get_time(void)
{
    static uint8_t date[] = {"Mon, 07 Feb 2011 12:00:00 GMT"};
    SYS_TIME *ptime;

    ptime = get_sys_time();

    if (NULL != ptime)
    {
        sprintf((char *)date, "%s, %02d %s %4d %02d:%02d:%02d GMT",
                conv_day_for_systime(ptime->year, ptime->month, ptime->day),
                ptime->day,
                conv_month_for_systime(ptime->month),
                ptime->year,
                ptime->hour,
                ptime->min,
                ptime->sec
               );
    }

    return date;
}

static uint8_t *conv_month_for_systime(int32_t file_month)
{
    return (uint8_t*)month_data[file_month-1];
}


static uint8_t *conv_day_for_systime(int32_t tmp_year, int32_t tmp_month, int32_t tmp_day)
{
    if ((tmp_month == 1) || (tmp_month == 2))
    {
        tmp_year -= 1;
        tmp_month += 12;
    }
    return (uint8_t*)day_data[((tmp_year + (tmp_year/4) - (tmp_year/100) + (tmp_year/400) + ((13*tmp_month + 8)/5) + tmp_day) % 7)];
}

ER http_callback(ID cepid, FN fncd , VP p_parblk)
{

    ER   parblk = *(ER *)p_parblk;
    ER   ercd;
    ID   cepid_oft;

    if (cepid > HTTP_START_TCP_CEP)
    {
        cepid_oft = cepid - HTTP_START_TCP_CEP;
    }
    else /* if (cepid > HTTP_START_TCP_CEP) */
    {
        while (1);  /* System error !! */
    }

    switch (fncd)
    {
        case TFN_TCP_ACP_CEP:
            http_cep[cepid_oft-1].status = HTTPD_WAIT_REQUEST;
            tcp_rcv_dat(cepid, http_cep[cepid_oft-1].rcv_buff, sizeof(http_cep[cepid_oft-1].rcv_buff), TMO_NBLK);
            break;
        case TFN_TCP_SND_DAT:
            if (parblk < 0)
            {
                /* In case : FORCE DISCONNECT */
                http_cep[cepid_oft-1].now_data = 0;
                http_cep[cepid_oft-1].remain_data = 0;
                tcp_cls_cep(cepid, TMO_NBLK);
                http_cep[cepid_oft-1].status = HTTPD_CLOSING;
            }
            if (http_cep[cepid_oft-1].status == HTTPD_SEND_RESPONSE_HEADER)
            {
                http_cep[cepid_oft-1].now_data += parblk;
                http_cep[cepid_oft-1].remain_data -= parblk;
                if (http_cep[cepid_oft-1].remain_data == 0)
                {
                    /* get file data */
                    if (http_cep[cepid_oft-1].res_info.res.type == RESTYPE_FILE)
                    {
                        if (file_read(http_cep[cepid_oft-1].fileid, http_cep[cepid_oft-1].body_buff, BODY_BUF_SIZE) < 0)
                        {
                            /* no more transmit when error has occured */
                            http_cep[cepid_oft-1].now_data = 0;
                            http_cep[cepid_oft-1].remain_data = 0;
                            tcp_cls_cep(cepid, TMO_NBLK);
                            http_cep[cepid_oft-1].status = HTTPD_CLOSING;
                            break;
                        }
                    }
                    http_cep[cepid_oft-1].status = HTTPD_SEND_RESPONSE_BODY;
                    http_cep[cepid_oft-1].now_data = 0;
                    http_cep[cepid_oft-1].remain_data = http_cep[cepid_oft-1].res_info.res.body_size;
                    if (http_cep[cepid_oft-1].remain_data > BODY_BUF_SIZE)
                    {
                        tcp_snd_dat(cepid, (VP)(http_cep[cepid_oft-1].res_info.res.body), BODY_BUF_SIZE, TMO_NBLK);
                    }
                    else if (http_cep[cepid_oft-1].remain_data > 0)
                    {
                        tcp_snd_dat(cepid, (VP)(http_cep[cepid_oft-1].res_info.res.body), http_cep[cepid_oft-1].res_info.res.body_size, TMO_NBLK);
                    }
                    else
                    {
                        /* no transmit when there is no body data */
                        http_cep[cepid_oft-1].now_data = 0;
                        http_cep[cepid_oft-1].remain_data = 0;
                        tcp_cls_cep(cepid, TMO_NBLK);
                        http_cep[cepid_oft-1].status = HTTPD_CLOSING;
                        break;
                    }
                }
                else
                {
                    if (http_cep[cepid_oft-1].remain_data > BODY_BUF_SIZE)
                    {
                        tcp_snd_dat(cepid, (VP)(http_cep[cepid_oft-1].res_info.res.hdr + http_cep[cepid_oft-1].now_data), BODY_BUF_SIZE, TMO_NBLK);
                    }
                    else
                    {
                        tcp_snd_dat(cepid, (VP)(http_cep[cepid_oft-1].res_info.res.hdr + http_cep[cepid_oft-1].now_data), http_cep[cepid_oft-1].res_info.res.hdr_size, TMO_NBLK);
                    }
                }
            }
            else if (http_cep[cepid_oft-1].status == HTTPD_SEND_RESPONSE_BODY)
            {
                http_cep[cepid_oft-1].now_data += parblk;
                http_cep[cepid_oft-1].remain_data -= parblk;
                if (http_cep[cepid_oft-1].remain_data == 0)
                {
                    http_cep[cepid_oft-1].now_data = 0;
                    http_cep[cepid_oft-1].remain_data = 0;
                    tcp_cls_cep(cepid, TMO_NBLK);
                    http_cep[cepid_oft-1].status = HTTPD_CLOSING;
                    break;
                }
                else
                {
                    if (file_read(http_cep[cepid_oft-1].fileid, http_cep[cepid_oft-1].body_buff, BODY_BUF_SIZE) < 0)
                    {
                        /* no more transmit when error has occured */
                        http_cep[cepid_oft-1].now_data = 0;
                        http_cep[cepid_oft-1].remain_data = 0;
                        tcp_cls_cep(cepid, TMO_NBLK);
                        http_cep[cepid_oft-1].status = HTTPD_CLOSING;
                        break;
                    }
                    if (http_cep[cepid_oft-1].remain_data > BODY_BUF_SIZE)
                    {
                        tcp_snd_dat(cepid, (VP)(http_cep[cepid_oft-1].res_info.res.body), BODY_BUF_SIZE, TMO_NBLK);
                    }
                    else
                    {
                        tcp_snd_dat(cepid, (VP)(http_cep[cepid_oft-1].res_info.res.body), http_cep[cepid_oft-1].remain_data, TMO_NBLK);
                    }
                }
            }
            break;
        case TFN_TCP_RCV_DAT:
            /* receive request, return value -1 == error, 0 == complete, -2 == pend sending, -3 == continue */
            ercd = httpd_rcv_request(cepid_oft, http_cep[cepid_oft-1].rcv_buff, sizeof(http_cep[cepid_oft-1].rcv_buff), &http_cep[cepid_oft-1].res_info, *(ER *)p_parblk);

            /* complete */
            if (ercd == 0)
            {
                /* start transmitting response header */
                tcp_snd_dat(cepid, (VP)http_cep[cepid_oft-1].res_info.res.hdr, http_cep[cepid_oft-1].res_info.res.hdr_size, TMO_NBLK);
                http_cep[cepid_oft-1].status = HTTPD_SEND_RESPONSE_HEADER;
                http_cep[cepid_oft-1].now_data = 0;
                http_cep[cepid_oft-1].remain_data = http_cep[cepid_oft-1].res_info.res.hdr_size;
            }
            /* pend sending */
            else if (ercd == -2)
            {
                http_cep[cepid_oft-1].status = HTTPD_CGI_PENDING;
                break;
            }
            /* continue */
            else if (ercd == -3)
            {
                tcp_rcv_dat(cepid, http_cep[cepid_oft-1].rcv_buff + http_cep[cepid_oft-1].total_rcv_len, sizeof(http_cep[cepid_oft-1].rcv_buff) - http_cep[cepid_oft-1].total_rcv_len, TMO_NBLK);
            }
            /* error */
            else
            {
                tcp_cls_cep(cepid, TMO_NBLK);
                http_cep[cepid_oft-1].status = HTTPD_CLOSING;
                break;
            }
            break;
        case TFN_TCP_SHT_CEP:
            break;
        case TFN_TCP_CLS_CEP:
            http_cep[cepid_oft-1].status = HTTPD_CLOSED;
            file_close(http_cep[cepid_oft-1].fileid);
            http_cep[cepid_oft-1].fileid = -1;
            break;
        default:
            break;
    }
    return(0);
}

/*****************************************************************************
* Function Name: R_T4_HTTP_SERVER_GetVersion
* Description  : Returns the version of this module. The version number is
*                encoded such that the top two bytes are the major version
*                number and the bottom two bytes are the minor version number.
* Arguments    : none
* Return Value : version number
******************************************************************************/
#pragma inline(R_T4_HTTP_SERVER_GetVersion)
uint32_t  R_T4_HTTP_SERVER_GetVersion(void)
{
    uint32_t const version = (T4_HTTP_SERVER_VERSION_MAJOR << 16) | T4_HTTP_SERVER_VERSION_MINOR;

    return version;
}

/* Copyright 2005,2013 RENESAS ELECTRONICS CORPORATION */







